public class 요약노트 {}
/*
클래스 : 붕어빵 기계
-필드
-메서드
-생성자
가 올 수 있다

메서드 : 붕어빵 기계의 기능
        메서드 사용 이유 : 가독성
생긴 모양 : void 메서드명 ()
          void 메서드명 (매개변수)
          int 메서드명 ()        //int 자리에는 자료명, 변수, 특별한 메서드등이 들어옴
          int 메서드명 (매개변수)        //int 자리에는 자료명, 변수, 특별한 메서드등이 들어옴

생성자 : 클래스 안에 내용 : 붕어빵

게터와 세터 : 게터와 세터는 메서드이다. 필드를 프라이빗으로 하고 세터와 게터로만 접근해 원하는 정보만 필터링 할 수 있다.
사용이유 :
1. 데이터를 안전하게 저장하는 것이다.
2. 내가 만든 필드를 다른 라이브러리에서 호출해서
세터 : 내가 원하는 데이터를 출력 할 수 있다. ex) 이름에는 숫자를 입력할 수 없게 '필터링' 할 수 있다.
게터 : 내가 원하는 데이터를 받을 수 있다. 원하는 정보를 붙여서 줄 수 있음. ex) 내가 2414만 쳐도 2414@gmail.com을 붙여줌

절대원칙들
1. 파일(파일, 중활호, 메서드) 하나 안에서 만들어진 것은 다른 파일에서는 못 쓴다.
 */